* Emacs dark mode :emacs:

Automatically detect dark mode for Emacs GTK.

#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2025-11-05 Wed 22:30]
| Headline               | Time   |      |
|------------------------+--------+------|
| *Total time*           | *5:24* |      |
|------------------------+--------+------|
| Emacs dark mode        | 5:24   |      |
| \_  Compile emacs      |        | 0:09 |
| \_  Add dark mode      |        | 4:15 |
| \_  Add dark mode hook |        | 1:00 |
#+END:

** DONE Compile emacs
CLOSED: [2025-10-21 Tue 16:55]
:LOGBOOK:
CLOCK: [2025-10-21 Tue 16:46]--[2025-10-21 Tue 16:55] =>  0:09
:END:

** DONE Add dark mode
CLOSED: [2025-10-21 Tue 20:45]
:LOGBOOK:
CLOCK: [2025-10-25 Sat 21:00]--[2025-10-25 Sat 22:44] =>  1:44
CLOCK: [2025-10-22 Wed 21:00]--[2025-10-22 Wed 22:30] =>  1:30
CLOCK: [2025-10-21 Tue 19:44]--[2025-10-21 Tue 20:45] =>  1:01
:END:

** DONE Add dark mode hook
CLOSED: [2025-11-05 Wed 22:29]
:LOGBOOK:
CLOCK: [2025-11-05 Wed 21:15]--[2025-11-05 Wed 22:15] => 1:00
:END:

** DONE Move dark mode toggling to separate thread
CLOSED: [2025-11-06 Thu 22:29]
:LOGBOOK:
CLOCK: [2025-11-06 Thu 21:15]--[2025-11-06 Thu 22:15] => 1:00
:END:

** DONE Add toolkit theme variable
CLOSED: [2025-11-08 Sat 22:29]
:LOGBOOK:
CLOCK: [2025-11-08 Sat 21:15]--[2025-11-08 Sat 22:15] => 1:00
CLOCK: [2025-11-12 Tue 21:15]--[2025-11-12 Tue 22:15] => 1:00
:END:
